two_Blade_Case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

12
(
    AMIinL
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          69;
        startFace       25442;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  AMIoutL;
    }
    AMIinR
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          69;
        startFace       25511;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  AMIoutR;
    }
    AMIoutL
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          69;
        startFace       25580;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  AMIinL;
    }
    AMIoutR
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          69;
        startFace       25649;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  AMIinR;
    }
    Border
    {
        type            wall;
        inGroups        1(wall);
        nFaces          38;
        startFace       25718;
    }
    Hole1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          48;
        startFace       25756;
    }
    Hole2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          48;
        startFace       25804;
    }
    Inlet
    {
        type            patch;
        nFaces          19;
        startFace       25852;
    }
    Outlet
    {
        type            patch;
        nFaces          19;
        startFace       25871;
    }
    rotorIn
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          99;
        startFace       25890;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  rotorOut;
    }
    rotorOut
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          99;
        startFace       25989;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  rotorIn;
    }
    BaseAndTop
    {
        type            empty;
        inGroups        1(empty);
        nFaces          34124;
        startFace       26088;
    }
)

// ************************************************************************* //
